#include<iostream>
using namespace std;
int main51() {
	//特点1：数组中的每个数据元素都是==相同的数据类型==
	//特点2：数组是由连续的内存位置组成的
		/*1. 数据类型  数组名[ 数组长度 ]; 
		2. 数据类型  数组名[数组长度] = { 值1，值2 ... }; 
		3. 数据类型  数组名[] = { 值1，值2 ... }; */
	//下标从0开始，通过下标访问，从零开始索引
	//1.数据类型  数组名[ 数组长度 ]
	//int arr[5];
	////给数组中的元素进行赋值	
	//arr[0] = 10;
	//arr[1] = 20;
	//arr[2] = 30;
	//arr[3] = 40;
	//arr[4] = 50;
	////访问数组中的元素
	//cout << arr[0]<<endl;
	//cout << arr[1] << endl;
	//cout << arr[2] << endl;
	//cout << arr[3] << endl;
	//cout << arr[4] << endl;
	////2.数据类型  数组名[数组长度] = { 值1，值2 ... }; 
	//int arr2[5] = { 10,20,30,40,50 };//没有完全赋值时，会缺省为0
	////利用循环输出数组中的元素
	//for (int i = 0; i < 5; i++) {
	//	cout << arr2[i] << endl;
	//}
	//3. 数据类型  数组名[] = { 值1，值2 ... };
	int arr3[] = { 10,20,30,40,50 };//定义数组时，要么数组中的元素个数完全定义，要么数组中的元素完全定义
	for (int j = 0; j < 5; j++) {
		cout << arr3[j] << endl;
	}
	system("pause");
	return 0;
}